{
  "source": "Taiwan",
  "nodes": [
    {
      "title": "People's Republic of China",
      "category": "Country",
      "short_description": "Mainland government's political, military, and economic pressure shapes Taiwan’s security and international space."
    },
    {
      "title": "United States",
      "category": "Country",
      "short_description": "Primary security partner, arms supplier, and technology regulator affecting Taiwan’s defense and semiconductor ecosyste…"
    },
    {
      "title": "Taiwan Semiconductor Manufacturing Company (TSMC)",
      "category": "Company",
      "short_description": "World-leading foundry; anchor of Taiwan’s economy, jobs, and geopolitical leverage."
    },
    {
      "title": "Semiconductor manufacturing",
      "category": "Sector",
      "short_description": "Core industry driving exports, GDP, employment, and strategic relevance for Taiwan."
    },
    {
      "title": "Xi Jinping",
      "category": "Person",
      "short_description": "Sets PRC policy toward Taiwan; central to military posture and reunification strategy."
    },
    {
      "title": "Taiwan Relations Act (1979)",
      "category": "Regulation",
      "short_description": "U.S. law underpinning Taiwan’s defense support, arms sales, and deterrence commitments."
    },
    {
      "title": "PRC Anti-Secession Law (2005)",
      "category": "Regulation",
      "short_description": "Authorizes non-peaceful means against Taiwanese independence moves; escalates deterrence and security risks."
    },
    {
      "title": "U.S. semiconductor export controls on China (2022–)",
      "category": "Regulation",
      "short_description": "Restrict advanced chip equipment and know-how; reshape Taiwan’s supply chains and market access."
    },
    {
      "title": "Hon Hai Precision Industry (Foxconn)",
      "category": "Company",
      "short_description": "Major employer and electronics manufacturer; influences Taiwan’s economy and cross-strait industrial exposure."
    },
    {
      "title": "ASML Holding N.V.",
      "category": "Company",
      "short_description": "Sole EUV supplier; tool access constrains Taiwan’s leading-edge chip production capabilities."
    },
    {
      "title": "CHIPS and Science Act (2022)",
      "category": "Regulation",
      "short_description": "U.S. incentives driving overseas fab investments; affects Taiwan’s talent, supply chain, and competitiveness."
    },
    {
      "title": "2022 Taiwan Strait military exercises after Pelosi visit",
      "category": "Event",
      "short_description": "Large-scale PLA drills coercing Taiwan; normalized pressure on airspace, waters, and trade routes."
    },
    {
      "title": "Japan",
      "category": "Country",
      "short_description": "Key regional security partner and technology market; supports stability and semiconductor supply chains."
    }
  ]
}